Revit 2026 API

# FabricSheetBentFabricBendDirection Property

---

Specifies which wire direction of the fabric sheet is bent.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BentFabricBendDirection BentFabricBendDirection { get; set; }
```
```vb
Public Property BentFabricBendDirection As BentFabricBendDirection
	Get
	Set
```
```cpp
public:
property BentFabricBendDirection BentFabricBendDirection {
	BentFabricBendDirection get ();
	void set (BentFabricBendDirection value);
}
```
```fsharp
member BentFabricBendDirection : BentFabricBendDirection with get, set
```

#### Property Value

BentFabricBendDirection

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidObjectException | When setting this property: The data-setting method is not applicable to fabric sheets that are flat. |

This parameter applies only to bent fabric sheets.

#### Reference

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace